ams/src/Documents/_ТранспортныеУслуги/_ТранспортныеУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>_ТранспортныеУслуги</name>
  <registerRecords>InformationRegister._ОплатаРейсов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef._СтатусыАктовПоПеревозкам</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Рейсы</name>
    <attributes>
      <name>Метка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛогистическийЛист</name>
      <type>
        <types>DocumentRef.AMS_ЛогистическийЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаВодителя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаАгента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьПропуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоставкаПалет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоставкаВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодвозПалет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодвозВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоплатаЗаДополнительноеВремя</name>
    <attributes>
      <name>ЛогистическийЛист</name>
      <type>
        <types>DocumentRef.AMS_ЛогистическийЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРаспоряжения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьЧека</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Метка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрафыЗаНарушенияДоговора</name>
    <attributes>
      <name>ЛогистическийЛист</name>
      <type>
        <types>DocumentRef.AMS_ЛогистическийЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРаспоряжения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоговора</name>
      <type>
        <types>EnumRef._ПунктыДоговора</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаШтрафа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Метка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрафыЗаПретензии</name>
    <attributes>
      <name>ЛогистическийЛист</name>
      <type>
        <types>DocumentRef.AMS_ЛогистическийЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРаспоряжения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СодержаниеПретензии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПретензии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Метка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/InformationRegisters/_Рейсы/_Рейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>_Рейсы</name>
  <comment>Рейсы</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Пробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесДоставка</name>
    <comment>тонна</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПалетДоставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесПодвоз</name>
    <comment>тонна</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПалетПодвоз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаВодителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПропуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаАгента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/InformationRegisters/_РейсыРаспоряжения/_РейсыРаспоряжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>_РейсыРаспоряжения</name>
  <comment>Распоряжения логистических листов</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаШтрафа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПретензии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПередачаТоваровХранителю</types>
      <types>DocumentRef.AMS_ПередачаВПереработку</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоговора</name>
    <type>
      <types>EnumRef._ПунктыДоговора</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеПретензии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подвоз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОрганизацияЗаказа</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредставлениеРаспоряжения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/Enums/AMS_СтатусыРеализаций/AMS_СтатусыРеализаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_СтатусыРеализаций</name>
  <enumValues>
    <name>Заказ</name>
  </enumValues>
  <enumValues>
    <name>Стикерование</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружено</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоРаспискеЭкспедитора</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоСканДов</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоДов</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоУПД</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоСканДов_УПД</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоУПДестьТНнет</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытаБезДоверенности</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ_12_Удалить</name>
  </enumValues>
</mdclass:Enum>

ams/src/Documents/_ТранспортныеУслуги/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ГруппаТЧ.Видимость = AMS_ВызовСервера.ЭтоKhors();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодсчетИтогов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	ЗаполнитьШапкуПоПартнеру();
	ЗополнитьТаблицыДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ЗополнитьТаблицыДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ЗополнитьТаблицыДокумента();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ЗаполнитьШапкуПоКонтрагенту();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРейсы

&НаКлиенте
Процедура РейсыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Не (Поле.Имя = "РейсыСтоимостьДоставки" Или Поле.Имя = "РейсыКоэффициент") Тогда
		ПоказатьЗначение( , Элемент.ТекущиеДанные.ЛогистическийЛист);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоплатаЗаДополнительноеВремя

&НаКлиенте
Процедура ДоплатаЗаДополнительноеВремяЛогистическийЛистНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МеЛогистическийЛист = ТекущийЭлемент.ТекущиеДанные.ЛогистическийЛист;
КонецПроцедуры

&НаКлиенте
Процедура ДоплатаЗаДополнительноеВремяМеткаПриИзменении(Элемент)
	ПодсчетИтогДоплата();
КонецПроцедуры

&НаКлиенте
Процедура ДоплатаЗаДополнительноеВремяЛогистическийЛистПриИзменении(Элемент)
	ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
	ЛогистическийЛист = ТекущиеДанные.ЛогистическийЛист;

	Если Не МеЛогистическийЛист = ЛогистическийЛист Тогда
		ТекущиеДанные.ТранспортноеСредство = Неопределено;
		ТекущиеДанные.Водитель             = Неопределено;
		ТекущиеДанные.Распоряжение         = Неопределено;
		ТекущиеДанные.СтоимостьЧека        = 0;
	КонецЕсли;

	Стр = ПолучитьДанныеСтрокиПоЛогистическомуЛисту(ЛогистическийЛист);
	Если Не Стр = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, Стр);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШтрафыЗаНарушенияДоговора

&НаКлиенте
Процедура ШтрафыЗаНарушенияДоговораМеткаПриИзменении(Элемент)
	ПодсчетИтогДоговор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШтрафыЗаПретензии

&НаКлиенте
Процедура ШтрафыЗаПретензииМеткаПриИзменении(Элемент)
	ПодсчетИтогПретензия();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПечатьАктВыполненныхРабот(Команда)
	Массив = Новый Массив;
	Массив.Добавить(Объект.Ссылка);

	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.AMS_Продажи", "АктПоПеревозкам", Массив, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДополнительноеСоглашение(Команда)
	Массив = Новый Массив;
	Массив.Добавить(Объект.Ссылка);

	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.AMS_Продажи", "ДопСоглашение", Массив, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДвижениеДокумента(Команда)
	СсылкаНаОбъект = Объект.Ссылка;
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("ПараметрКоманды", СсылкаНаОбъект);

		ОткрытьФорму("Отчет.ДвиженияДокумента.Форма", ПараметрыФормы, ЭтотОбъект, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеДокументы(Команда)
	МенюОтчетыУТКлиент.СтруктураПодчиненности(Объект.Ссылка, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРейсы(Команда)
	ЗополнитьТаблицыДокумента();
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьШапкуПоПартнеру()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);

	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Контрагент КАК Контрагент,
	|	т.Договор КАК Договор
	|ИЗ
	|	Документ._ТранспортныеУслуги КАК т
	|ГДЕ
	|	т.Дата < &Дата
	|	И т.Организация = &Организация
	|	И т.Партнер = &Партнер
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.Дата УБЫВ";

	Рез = Запрос.Выполнить();

	Если Не Рез.Пустой() Тогда
		Выб = Рез.Выбрать();
		Выб.Следующий();
		Объект.Контрагент = Выб.Контрагент;
		Объект.Договор    = Выб.Договор;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШапкуПоКонтрагенту()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);

	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Договор КАК Договор
	|ИЗ
	|	Документ._ТранспортныеУслуги КАК т
	|ГДЕ
	|	т.Дата < &Дата
	|	И т.Организация = &Организация
	|	И т.Партнер = &Партнер
	|	И т.Контрагент = &Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.Дата УБЫВ";

	Рез = Запрос.Выполнить();

	Если Не Рез.Пустой() Тогда
		Выб = Рез.Выбрать();
		Выб.Следующий();
		Объект.Договор    = Выб.Договор;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеСтрокиПоЛогистическомуЛисту(ЛогистическийЛист)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛогистическийЛист", ЛогистическийЛист);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Док.ТранспортноеСредство КАК ТранспортноеСредство,
	|	Рейсы.Водитель КАК Водитель,
	|	Док.Распоряжение КАК Распоряжение,
	|	Док.СтоимостьЧека КАК СтоимостьЧека
	|ИЗ
	|	Документ.AMS_ЛогистическийЛист.Распоряжения КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ЛогистическийЛист.Рейсы КАК Рейсы
	|		ПО Док.Ссылка = Рейсы.Ссылка
	|			И Док.ТранспортноеСредство = Рейсы.ТранспортноеСредство
	|ГДЕ
	|	Док.Ссылка = &ЛогистическийЛист
	|	И Док.ЕстьЧек";

	Табл = Запрос.Выполнить().Выгрузить();

	Если Табл.Количество() = 0 Тогда
		Возврат Неопределено;

	ИначеЕсли Табл.Количество() = 1 Тогда
		Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Табл[0]);

	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ЗополнитьТаблицыДокумента()
	Статус = Новый Массив;
	Статус.Добавить(Перечисления.AMS_СтатусыРеализаций.Заказ);
	Статус.Добавить(Перечисления.AMS_СтатусыРеализаций.Стикерование);
	Статус.Добавить(Перечисления.AMS_СтатусыРеализаций.КОтгрузке);
	Статус.Добавить(Перечисления.AMS_СтатусыРеализаций.Отгружено);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Объект.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	Запрос.УстановитьПараметр("Перевозчик", Объект.Партнер);
	Запрос.УстановитьПараметр("Статус", Статус);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Регистратор КАК ЛогистическийЛист,
	|	т.ТранспортноеСредство КАК ТранспортноеСредство,
	|	т.Водитель КАК Водитель,
	|	т.ВесДоставка КАК ВесДоставка,
	|	т.КоличествоПалетДоставка КАК ПалетДоставка,
	|	т.ВесПодвоз КАК ВесПодвоз,
	|	т.КоличествоПалетПодвоз КАК ПалетПодвоз,
	|	т.СтавкаВодителя КАК СтавкаВодителя,
	|	т.СтавкаАгента КАК СтавкаАгента,
	|	т.СтоимостьПропуска КАК СтоимостьПропуска,
	|	т.Коэффициент КАК Коэффициент,
	|	т.СтоимостьДоставки КАК СтоимостьДоставки
	|ПОМЕСТИТЬ Рейсы
	|ИЗ
	|	РегистрСведений._Рейсы КАК т
	|ГДЕ
	|	т.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И т.Перевозчик = &Перевозчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Рейсы.ЛогистическийЛист КАК ЛогистическийЛист,
	|	Рейсы.ТранспортноеСредство КАК ТранспортноеСредство,
	|	МИНИМУМ(ВЫБОР
	|		КОГДА упд.Распоряжение ССЫЛКА Документ.РеализацияТоваровУслуг
	|		И упд.Распоряжение.AMS_СтатусРеализации В (&Статус)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ) КАК Метка
	|ПОМЕСТИТЬ Док
	|ИЗ
	|	Рейсы КАК Рейсы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.AMS_ЛогистическийЛист.Распоряжения КАК упд
	|		ПО Рейсы.ЛогистическийЛист = упд.Ссылка
	|		И Рейсы.ТранспортноеСредство = упд.ТранспортноеСредство
	|СГРУППИРОВАТЬ ПО
	|	Рейсы.ЛогистическийЛист,
	|	Рейсы.ТранспортноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Док.Метка КАК Метка,
	|	Рейсы.ЛогистическийЛист КАК ЛогистическийЛист,
	|	Рейсы.ТранспортноеСредство КАК ТранспортноеСредство,
	|	Рейсы.Водитель КАК Водитель,
	|	Рейсы.СтавкаВодителя КАК СтавкаВодителя,
	|	Рейсы.СтавкаАгента КАК СтавкаАгента,
	|	Рейсы.СтоимостьПропуска КАК СтоимостьПропуска,
	|	Рейсы.Коэффициент КАК Коэффициент,
	|	Рейсы.СтоимостьДоставки КАК СтоимостьДоставки,
	|	100 * Рейсы.ПалетДоставка / ВЫБОР
	|		КОГДА Авто.AMS_КоличествоПалет = 0
	|			ТОГДА 1
	|		ИНАЧЕ Авто.AMS_КоличествоПалет
	|	КОНЕЦ КАК ДоставкаПалет,
	|	100 * Рейсы.ВесДоставка / ВЫБОР
	|		КОГДА Авто.ГрузоподъемностьВТоннах = 0
	|			ТОГДА 1
	|		ИНАЧЕ Авто.ГрузоподъемностьВТоннах
	|	КОНЕЦ КАК ДоставкаВес,
	|	100 * Рейсы.ПалетПодвоз / ВЫБОР
	|		КОГДА Авто.AMS_КоличествоПалет = 0
	|			ТОГДА 1
	|		ИНАЧЕ Авто.AMS_КоличествоПалет
	|	КОНЕЦ КАК ПодвозПалет,
	|	100 * Рейсы.ВесПодвоз / ВЫБОР
	|		КОГДА Авто.ГрузоподъемностьВТоннах = 0
	|			ТОГДА 1
	|		ИНАЧЕ Авто.ГрузоподъемностьВТоннах
	|	КОНЕЦ КАК ПодвозВес
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Рейсы КАК Рейсы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Док КАК Док
	|		ПО Рейсы.ЛогистическийЛист = Док.ЛогистическийЛист
	|		И Рейсы.ТранспортноеСредство = Док.ТранспортноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТранспортныеСредства КАК Авто
	|		ПО Рейсы.ТранспортноеСредство = Авто.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(вт.Метка) КАК Метка,
	|	вт.ЛогистическийЛист КАК ЛогистическийЛист,
	|	вт.ТранспортноеСредство КАК ТранспортноеСредство,
	|	вт.Водитель КАК Водитель,
	|	МАКСИМУМ(вт.СтавкаВодителя) КАК СтавкаВодителя,
	|	МАКСИМУМ(вт.СтавкаАгента) КАК СтавкаАгента,
	|	МАКСИМУМ(вт.СтоимостьПропуска) КАК СтоимостьПропуска,
	|	МАКСИМУМ(вт.Коэффициент) КАК Коэффициент,
	|	вт.СтоимостьДоставки КАК СтоимостьДоставки,
	|	МАКСИМУМ(вт.ДоставкаПалет) КАК ДоставкаПалет,
	|	МАКСИМУМ(вт.ДоставкаВес) КАК ДоставкаВес,
	|	МАКСИМУМ(вт.ПодвозПалет) КАК ПодвозПалет,
	|	МАКСИМУМ(вт.ПодвозВес) КАК ПодвозВес
	|ИЗ
	|	вт КАК вт
	|СГРУППИРОВАТЬ ПО
	|	вт.ТранспортноеСредство,
	|	вт.ЛогистическийЛист,
	|	вт.Водитель,
	|	вт.СтоимостьДоставки
	|
	|УПОРЯДОЧИТЬ ПО
	|	вт.ЛогистическийЛист.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Регистратор КАК ЛогистическийЛист,
	|	т.ТранспортноеСредство КАК ТранспортноеСредство,
	|	вт.Водитель КАК Водитель,
	|	т.Распоряжение КАК Распоряжение,
	|	т.ПредставлениеРаспоряжения КАК ПредставлениеРаспоряжения,
	|	т.СтоимостьЧека КАК СтоимостьЧека
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений._РейсыРаспоряжения КАК т
	|		ПО вт.ЛогистическийЛист = т.Регистратор
	|		И вт.ТранспортноеСредство = т.ТранспортноеСредство
	|ГДЕ
	|	т.СтоимостьЧека > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Регистратор КАК ЛогистическийЛист,
	|	т.ТранспортноеСредство КАК ТранспортноеСредство,
	|	вт.Водитель КАК Водитель,
	|	т.Распоряжение КАК Распоряжение,
	|	т.ПредставлениеРаспоряжения КАК ПредставлениеРаспоряжения,
	|	т.ПунктДоговора КАК ПунктДоговора,
	|	т.СуммаШтрафа КАК СуммаШтрафа
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений._РейсыРаспоряжения КАК т
	|		ПО вт.ЛогистическийЛист = т.Регистратор
	|		И вт.ТранспортноеСредство = т.ТранспортноеСредство
	|ГДЕ
	|	т.СуммаШтрафа > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Регистратор КАК ЛогистическийЛист,
	|	т.ТранспортноеСредство КАК ТранспортноеСредство,
	|	вт.Водитель КАК Водитель,
	|	т.Распоряжение КАК Распоряжение,
	|	т.ПредставлениеРаспоряжения КАК ПредставлениеРаспоряжения,
	|	т.СодержаниеПретензии КАК СодержаниеПретензии,
	|	т.СуммаПретензии КАК СуммаПретензии
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений._РейсыРаспоряжения КАК т
	|		ПО вт.ЛогистическийЛист = т.Регистратор
	|		И вт.ТранспортноеСредство = т.ТранспортноеСредство
	|ГДЕ
	|	т.СуммаПретензии > 0";

	Рез = Запрос.ВыполнитьПакет();

	Объект.Рейсы.Загрузить(Рез[3].Выгрузить());
	Объект.ДоплатаЗаДополнительноеВремя.Загрузить(Рез[4].Выгрузить());
	Объект.ШтрафыЗаНарушенияДоговора.Загрузить(Рез[5].Выгрузить());
	Объект.ШтрафыЗаПретензии.Загрузить(Рез[6].Выгрузить());
КонецПроцедуры

&НаСервере
Процедура ПодсчетИтогДоплата()
	ИтогДоплата = 0;

	Табл = Объект.ДоплатаЗаДополнительноеВремя;

	Для Каждого Стр Из Табл Цикл
		Если Стр.Метка Тогда
			ИтогДоплата = ИтогДоплата + Стр.СтоимостьЧека;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПодсчетИтогДоговор()
	ИтогДоговор = 0;

	Табл = Объект.ШтрафыЗаНарушенияДоговора;

	Для Каждого Стр Из Табл Цикл
		Если Стр.Метка Тогда
			ИтогДоговор = ИтогДоговор + Стр.СуммаШтрафа;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПодсчетИтогПретензия()
	ИтогПретензия = 0;

	Табл = Объект.ШтрафыЗаПретензии;

	Для Каждого Стр Из Табл Цикл
		Если Стр.Метка Тогда
			ИтогПретензия = ИтогПретензия + Стр.СуммаПретензии;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПодсчетИтогов()
	ПодсчетИтогДоплата();
	ПодсчетИтогДоговор();
	ПодсчетИтогПретензия();
КонецПроцедуры

#КонецОбласти
